In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
df = pd.read_excel('C:\\Users\\biboy\\Desktop\\PJDSC\\dataset\\DEBIT CARD TXNS_PJDSC.xlsx')

In [4]:
df.to_csv('CREDIT CARD TXNS_PJDSC')

In [6]:
df.head()

      CUST_NUM CHANNEL       DATE   TIME        AMOUNT
0  3659.137057     POS 2023-04-01  39958  30001.039678
1  3659.137057     POS 2023-04-04  51349  20001.662634
2  3659.137057     POS 2023-04-05  42803  22001.514584
3  3659.137057     POS 2023-04-06  51455  30001.529392
4  3659.137057     POS 2023-04-11  62752  22001.092602

In [7]:
df.tail()

            CUST_NUM CHANNEL       DATE   TIME       AMOUNT
369589   8741.051424     POS 2023-06-30  31959  2501.112409
369590  13227.959858     POS 2023-06-30  31333     1.192864
369591  13227.959858     POS 2023-06-30  31369  2201.563526
369592   4291.233389     POS 2023-06-30  54799   701.164580
369593   5560.304128     POS 2023-06-30  36343  6002.154578

In [8]:
df.shape

(369594, 5)

Findings: There are 369, 594 rows and 5 columns in total for the Credit Card Transactions

In [9]:
df.isna().sum()

CUST_NUM    0
CHANNEL     0
DATE        0
TIME        0
AMOUNT      0
dtype: int64

Findings: There are no missing values in the data frame.

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 369594 entries, 0 to 369593
Data columns (total 5 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   CUST_NUM  369594 non-null  float64
 1   CHANNEL   369594 non-null  object
 2   DATE      369594 non-null  datetime64[ns]
 3   TIME      369594 non-null  int64
 4   AMOUNT    369594 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(1)
memory usage: 14.1+ MB